/*Напишите цикл, который принимает 
на вход два числа (A и B) и возводит число A 
в натуральную степень B. Без модуля Math, используем цикл for.*/


/*int k = int.Parse(Console.ReadLine());
int num = int.Parse(Console.ReadLine());

for(int i = 0; i < k; i++) 
    num = num*num;
Console.WriteLine(num);
*/


